app/controllers/accounts_controller.rb

  def login
    user = Account.find_by(user_name: params[:account][:user_name])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_name" = $1 LIMIT $2  [["user_name", "jS"], ["LIMIT", 1]]

  def create
    @account = Account.new(account_params)

    if @account.save
---
INSERT INTO "accounts" ("user_name", "f_name", "l_name", "location", "bio", "created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"