app/controllers/bids_controller.rb

  def index
    @bids = Bid.all
---
SELECT "bids".* FROM "bids"

  def create
    @bid = Bid.new(bid_params)
    @bid.project_id = params[:project_id]
    @bid.account_id = params[:account_id]

    if @bid.save
---
INSERT INTO "bids" ("price", "created_at", "updated_at", "project_id", "account_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", "1000000.0"], ["created_at", "2019-08-14 18:34:37.129684"], ["updated_at", "2019-08-14 18:34:37.129684"], ["project_id", 1], ["account_id", 3]]

  def destroy
    @bid.destroy
---
DELETE FROM "bids" WHERE "bids"."id" = $1  [["id", 2]]

    def set_bid
      @bid = Bid.find(params[:id])
---
SELECT "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]