app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    @project.account_id = params[:account_id]

    if @project.save
---
INSERT INTO "projects" ("name", "description", "t_frame", "budget", "created_at", "updated_at", "account_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"